{"extracted_information": "Supabase is officially SOC2 Type 2 and HIPAA compliant, enabling users to build enterprise healthcare applications on their hosted platform. The company achieved SOC2 Type 2 certification on May 22, 2023, and conducts annual Type 2 audits. HIPAA compliance followed, with Supabase acting as a Business Associate. Customers handling Protected Health Information (PHI) can now use the hosted platform with a HIPAA add-on by signing a Business Associate Agreement (BAA). Key compliance features include robust incident management, detailed auditing processes, and adherence to vendor-specific HIPAA requirements.", "specifications": {"soc2_type_2": {"status": "Compliant", "certification_date": "May 22, 2023", "audit_frequency": "Annual Type 2 audits", "audit_process_details": {"evidence_requests": ["List of all incidents within a given time period with postmortem for selected incidents", "List of all access requests within a given time period", "List of vulnerabilities and their remediation dates", "List of Data deletion requests and evidence of action within SLA"], "tools_used": "Vanta (compliance monitoring tool)"}}, "hipaa": {"status": "Compliant", "role": "Business Associate (performs functions with PHI on behalf of a covered entity)", "customer_types_supported": "Covered Entities or other Business Associates", "compliance_process_from_soc2": "Leveraged existing SOC2 controls and used the same auditor; additional evidence for encryption, audit logs, business continuity, and disaster recovery was already available. Facility Access Controls not applicable (remote company).", "vendor_management": {"baa_requirement": "Supabase signs Business Associate Agreements (BAAs) with its vendors (e.g., AWS).", "service_eligibility": "Requires using vendors' HIPAA Eligible Services (e.g., AWS HIPAA Eligible Services)."}, "customer_responsibilities": {"baa_requirement": "Customers must sign a BAA with Supabase to store PHI.", "documentation": "Customer responsibilities are documented in Supabase's shared responsibility model."}, "incident_management_changes": {"hipaa_breach_notification_rules": "Strict requirements for handling breaches.", "notification_timeline": "Business associates are required to notify the covered entity within 60 days of a breach.", "designated_officer": "Appointed HIPAA Security Officer responsible for reviewing PHI disclosure breaches and communicating their impact."}, "policy_updates": ["Updated policies to cover HIPAA requirements, including enforcing automatic log-offs as part of workstation security policy."], "insurance": "Finalized Technology Errors and Omissions Insurance plan."}}, "pricing": {"hipaa_add_on": {"availability": "Available for hosted platform users by signing a BAA. Specific pricing not detailed; requires contacting the Supabase team."}}, "features": ["Ability to build healthcare applications on Supabase's hosted platform.", "Support for signing Business Associate Agreements (BAAs).", "Secure infrastructure based on SOC2 Type 2 and HIPAA controls.", "Comprehensive incident management processes compliant with HIPAA Breach Notification rules.", "Processes for tracking and fulfilling data deletion requests within defined SLAs.", "Processes for tracking access requests and vulnerability remediation."], "statistics": {"hipaa_fines_potential": "Up to $1.9 million per violation per calendar year, depending on the severity of the breach."}, "temporal_info": {"soc2_type_2_certification_date": "May 22, 2023", "hipaa_compliance_announcement_date": "August 11, 2023", "soc2_audit_frequency": "Annual"}, "geographical_data": {"hipaa_applicability": "US law"}, "references": ["https://supabase.com/blog/supabase-soc2", "https://www.vanta.com/", "https://supabase.com/docs/guides/self-hosting", "https://github.com/orgs/supabase/discussions/1219", "https://aws.amazon.com/compliance/hipaa-eligible-services-reference/", "/docs/guides/platform/shared-responsibility-model#managing-healthcare-data", "https://www.hhs.gov/hipaa/for-professionals/breach-notification/index.html", "https://www.strongdm.com/blog/hipaa-violation-penalties", "https://forms.supabase.com/hipaa2"]}