{"extracted_information": "Supabase is introducing new observability features, monitoring, and debugging capabilities, including OpenTelemetry support, a New Logging Interface, Advanced Product Reports, and an AI Assistant with debugging functionalities. These updates aim to provide unified, end-to-end observability, making it easier to trace, analyze errors, performance issues, and troubleshoot the entire stack natively within Supabase, reducing the need for external monitoring infrastructure. Advanced metrics and certain debugging capabilities are tiered, with some advanced features for paid customers.", "specifications": {}, "pricing": {"advanced_metrics_availability": "Free users get basic metrics for all products. Advanced metrics (e.g., p99 response time) available for all paid customers."}, "features": [{"name": "OpenTelemetry (OTel) Support", "description": "Standardizes logs, metrics, and traces in a vendor-agnostic format. Enables ingestion into third-party tools like Datadog, Honeycomb, or existing monitoring solutions. Data will also be surfaced natively in the Supabase dashboard.", "status": "Starting to add support to all core products (Storage, Auth, Edge Runtime, Realtime) and Telemetry server."}, {"name": "New Logging Interface", "description": "Provides a single, interleaved stream of logs across all Supabase services, allowing tracing of a single request across the entire stack. Includes contextual log views (jump from function invocation to execution logs) and filtering options.", "status": "Coming soon.", "capabilities": ["Unified log stream across services (Storage, Postgres, Edge Functions, Auth, Realtime).", "Contextual log views.", "Filtering by request status code, method, path, log level, and associated auth user.", "Currently supports API Gateway logs and Postgres logs, with other products' logs coming soon."]}, {"name": "Advanced Product Reports", "description": "Revamped metrics directly accessible in the Supabase dashboard, reducing the need for self-hosting Grafana. Provides common metrics (number of requests, egress, response time) and product-specific metrics (e.g., Realtime connected clients).", "capabilities": ["Common metrics: number of requests, egress, response time.", "Product-specific metrics (e.g., Realtime connected clients).", "Drill-down into specific time frames.", "Filtering by various request and response parameters across all reports."]}, {"name": "Supabase AI Assistant with debugging capabilities", "description": "Offers powerful new debugging features to identify and resolve issues.", "status": "Coming soon.", "capabilities": ["Retrieve logs for any Supabase product.", "Analyze log volume over time to identify spikes.", "Drill into specific time windows to investigate anomalies.", "Automatic chat renaming based on queries.", "Branch diff reviews (for projects using branching environments).", "More capable AI model with additional controls for data privacy and security improvements.", "Provides recommendations for fixes."]}], "statistics": {}, "temporal_info": {"release_date": "17 Jul 2025", "roadmap": ["Keep adding more metrics across reports.", "Adding logs from remaining products to new logging interface.", "New logging interface to become default experience for all projects soon.", "Expose OpenTelemetry trace information in the logging interface."]}, "geographical_data": {}, "references": []}