{"extracted_information": "Supabase is SOC 2 Type 2 compliant, with annual assessments covering security, availability, processing integrity, confidentiality, and privacy for both customer relationship data and data within its backend as a service (Postgres, Storage, Authentication, Realtime, Edge Functions, Data API). Compliance operates under a Shared Responsibility Model, with Supabase implementing robust security measures, conducting yearly audits, maintaining incident response, and providing reports. Customers are responsible for due diligence, monitoring, and their own compliance controls. The SOC 2 boundary is within the Supabase product; it does not cover external environments, specific data residency mandates, or industry-specific regulations like HIPAA for PHI.", "specifications": {"soc2_compliance_status": "SOC 2 Type 2 compliant", "audit_frequency": "Annually", "audited_trust_services_criteria": ["Security", "Availability", "Processing Integrity", "Confidentiality", "Privacy"], "scope_of_compliance": {"customer_relationship_data": "Billing, contact, usage, and contract information managed by Supabase.", "backend_as_a_service_product": "Data hosted within Supabase product features: Postgres Database, Storage, Authentication, Realtime, Edge Functions, and Data API.", "security_compliance_boundary": "Data within the Supabase product or under Supabase's control. Excludes environments outside Supabase's control (part of Shared Responsibility Model)."}}, "pricing": {"soc2_report_access_eligibility": "Enterprise and Team Plan customers", "soc2_report_access_method": "Downloadable from the 'Legal Documents' section in the organization dashboard."}, "features": {"supabase_responsibilities_enterprise_security_controls": [{"title": "Security Measures", "description": "Implements robust security controls to protect customer data, prevent data breaches, and ensure confidentiality and integrity. Measures meet industry standards and are subject to regular audits.", "specific_controls_at_boundary": ["Preventing unauthorized access", "Monitoring data access", "Alerting", "Data backups", "Redundancy"]}, {"title": "Compliance Audits", "description": "Undergoes yearly SOC 2 audits by an independent third party to verify data management practices against the Trust Services Criteria (TSC)."}, {"title": "Incident Response", "description": "Maintains an incident response plan for efficient handling of data breaches, covering detection, response, and vulnerability management."}, {"title": "Reporting", "description": "Provides a SOC 2 Type 2 report upon successful audit, assuring stakeholders of implemented safeguards."}], "customer_responsibilities_soc2_compliance": [{"title": "Compliance Requirements", "description": "Understand their own compliance requirements; many enterprise customers require SOC 2 reports from providers."}, {"title": "Due Diligence", "description": "Perform due diligence including reviewing Supabase's SOC 2 Type 2 report and understanding the division of responsibilities."}, {"title": "Monitoring and Review", "description": "Regularly monitor and review Supabase’s compliance status."}, {"title": "Control Compliance", "description": "Implement their own requisite controls and undergo their own SOC 2 audit if they need to be SOC 2 compliant."}, {"title": "Data Management (customer side)", "description": "Responsible for management, storage, and security/compliance controls for data on the customer side of the security boundary (data entering and leaving the Supabase product)."}], "shared_responsibilities_soc2_compliance": [{"title": "Data Security", "description": "Both parties ensure data security; customer's use of the platform must not compromise Supabase's controls."}, {"title": "Control Compliance", "description": "Supabase asserts its SOC 2 controls are met; customers needing SOC 2 compliance must verify their own security controls through their own audit."}]}, "statistics": {}, "temporal_info": {"audit_period": "Rolling 12-month window, from March 1st to February 28th of the next calendar year."}, "geographical_data": {"data_residency": {"soc2_coverage": "SOC 2 itself does not mandate specific data residency requirements.", "customer_responsibility": "Ensuring projects are deployed in the correct region (all data remains within chosen region). Customer is responsible for ensuring regions chosen for read replicas align with additional regulatory frameworks (e.g., GDPR)."}}, "references": [{"title": "System and Organization Controls: SOC Suite of Services", "url": "https://www.aicpa-cima.com/resources/landing/system-and-organization-controls-soc-suite-of-services"}, {"title": "Shared Responsibility Model", "url": "/docs/guides/deployment/shared-responsibility-model"}]}